//Рядки зеленого кольору - це коментарі, Ваша програма не читає те, що написано таким чином, тому ці коментарі використовуються для якоїсь додаткової інформації про код
//для інших розробників, які з ним працюють

//---------------------------------------------------------------------------------------------------------------------------------------------------------

//Створюємо змінну певного числового типу з назвою і зберігаємо в ній число
int a1;
a1 = 5;
int number = 500;
byte anotherNumber = 155;
long oneMoreNumber = 10000;
float floatNumber = 0.12345678912321F;
double doubleNumber = 0.12D;
decimal decimalNumber = 0.12312312312312312M;

//int numberBiggerThanIntMax = 2147483648; //Помилка виникає через те, що число, яке ми намагаємось зберігти більше ніж максимально можливе для типу int
//int numberWithDot = 0.12; //Тип даних int призначений для зберігання тільки цілих чисел, без крапки
//int sentence = "afsdf"; //Ми не можемо зберігати текст в числових типах

Console.WriteLine(number);
Console.WriteLine(anotherNumber);
Console.WriteLine(oneMoreNumber);
Console.WriteLine(floatNumber);
Console.WriteLine(doubleNumber);
Console.WriteLine(decimalNumber);

//-----------------------------------------------------------------------------------------------------------------------------------------------------------

//Можуть статись ситуації коли для нам потрібно число, яке трохи відрізняється від числа, яке ми вже зберегли у змінній.
//Наприклад, Ваша програма рахує скільки років Вам буде через певну кількість років
//В такому випадку ми спочатку кажемо програмі свій актуальний вік - створюємо змінну з Вашим віком
int age = 12;
//Після цього ми вже можемо створювати інші змінні з різними відмінностями, наприклад
int ageMinusFive = age - 5;
int agePlus38 = age + 38;

Console.WriteLine("Actual age: " + age);
Console.WriteLine("Age five years age: " + ageMinusFive);
Console.WriteLine("Age in 38 years: " + agePlus38);


//------------------------------------------------------------------------------------------------------------------------------------------------------------

//Іноді Ви можете побачити код, який виглядає наступним чином
int newNumber = number++; //Два плюси в програмуванні означає те ж саме що "+ 1".
                          //Тому коли ви бачите таке формулювання як number++, це означає що до значення змінної number додається один.
int num = number--; //Так само і два мінуси означають "- 1"

Console.WriteLine(newNumber);
Console.WriteLine(num);

//------------------------------------------------------------------------------------------------------------------------------------------------------------

//Як ми вже побачили, ми можемо зберігати значення одних змінних в інших. Важливо те, що ми можемо використовувати в таких операціях змінні різних типів.
//В цьому прикладі ми зберігаємо значення змінної типу BYTE у змінній типу INT.
//Тут все проходить нормально, бо тип BYTE має менший діапазон можливих чисел і повністю покривається можливостями типу INT
int numberConvertedToIntFromByte = anotherNumber;
//Тут також все добре, бо тип LONG має діапазон, який повністю покриває діапазон чисел, які можуть бути в типі INT
long numberConvertedToLongFromInt = number;

Console.WriteLine(numberConvertedToIntFromByte);
Console.WriteLine(numberConvertedToLongFromInt);

//Як ми бачимо, ми можемо брати число зі змінної іншого числового типу і зберігати, але треба бути обережним  - якщо змінна, з якої ми хочемо взяти число
//має більший діапазон чисел можливих, то Visual Studio покаже вам помилку, застерігаючи що такі дії можуть призвести до неправильної роботи програми.
//Це можна просто уявити як переливання води з однієї чашки до іншої - якщо чашка, з якої Ви будете брати воду - більша, то вода просто виллється, 
//тому програма вам не дає розлити цю воду і одразу каже що перша чашка значно більша і її кількість води може не влізти до другої, меншої.

//byte numberByteFromInt = initialIntNumber;
//int numberIntFromLong = initialLongNumber;

//Якщо Ви впевнені в тому що хочете все ж таки 
byte numberByteFromInt = (byte)oneMoreNumber; // Тут ми кажемо програмі що ми впевнені в тому, що хочемо взяти значення змінної типу INT як значення типу BYTE
//З цим треба бути дуже обережним, бо якщо число, все ж таки, буде більшим ніж дозволяє тип BYTE, то ми не зможемо зберегти в byte більше ніж його максимальне значення

Console.WriteLine(numberByteFromInt);


//-----------------------------------------------------------------------------------------------------------------------------------------------------------------

//Звісно що ми можемо таким чином зберегти число з плаваючою крапкою до змінної, яка такого числа не передбачає, як, наприклад, INT, але, таким чином, ми втратимо все,
//що маємо після крапки
int numberWithDot = (int)0.4;
int secondNumberWithDot = (int)5.99999999999999;

Console.WriteLine(numberWithDot);
Console.WriteLine(secondNumberWithDot);

//-----------------------------------------------------------------------------------------------------------------------------------------------------------------

int firstNumber = 15;
int secondNumber = 2;

int a = firstNumber - secondNumber; //Віднімаємо
int b = firstNumber + secondNumber; //Додаємо
int c = firstNumber * secondNumber; //Множиво
int d = firstNumber / secondNumber; //Ділимо
int e = firstNumber % secondNumber; //Знаходимо остачу після ділення

Console.WriteLine(a);
Console.WriteLine(b);
Console.WriteLine(c);
Console.WriteLine(d);
Console.WriteLine(e);

//Такий варіант не спрацює, бо спочатку програма робить операцію зі змінними, які у нас типу INT і отримує також значення типу INT. І після цього вже ми його зберігаємо
//в змінній типу DOUBLE, що призводить до того, що ми так само вже втратили те, що після крапки, ще на етапі операції ділення.
double r = firstNumber / secondNumber;
Console.WriteLine(r);

//Тут те ж саме, ми намагаємось привести результат ділення значень двох змінних типу INT до типу DOUBLE вже після того як операція була здійснена
double j = (double)(firstNumber / secondNumber);
Console.WriteLine(j);

//А от такі приклади, вже спрацюють як треба, бо ми робимо приведення до іншого типу не результату ділення, а самих чисел
double f = (double)firstNumber / secondNumber;
double g = firstNumber / (double)secondNumber;
double h = (double)firstNumber / (double)secondNumber;

Console.WriteLine(f);
Console.WriteLine(g);
Console.WriteLine(h);